{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "angry",
    "1": "anxious",
    "2": "calm",
    "3": "confused",
    "4": "happy",
    "5": "sad",
    "6": "stressed"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "angry": 0,
    "anxious": 1,
    "calm": 2,
    "confused": 3,
    "happy": 4,
    "sad": 5,
    "stressed": 6
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 1,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 50265
}
